collections/Plan de pruebas Actualizar inscripcion.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de pruebas Actualizar inscripcion" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo de Hilos Actualizar inscripcion" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Petición HTTP Actualizar inscripcion" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;student_id&quot;: 2,&#xd;
    &quot;school_period_id&quot;: 3,&#xd;
    &quot;financing&quot;:&quot;SFI&quot;,&#xd;
    &quot;financing_description&quot;:&quot;description&quot;,&#xd;
    &quot;pay_ref&quot;:&quot;123456789&quot;,&#xd;
    &quot;amount_paid&quot;:45.5,&#xd;
    &quot;subjects&quot;: [&#xd;
        {&#xd;
            &quot;school_period_subject_teacher_id&quot;: 3,&#xd;
            &quot;qualification&quot;:15,&#xd;
            &quot;status&quot;:&quot;APR&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;projects&quot;:[&#xd;
        {&#xd;
            &quot;title&quot;:&quot;proyecto del estudiante 2&quot;,&#xd;
            &quot;subject_id&quot;:15,&#xd;
            &quot;status&quot;:&quot;APPROVED&quot;,&#xd;
            &quot;description_status&quot;:&quot;Description de proyecto&quot;,&#xd;
            &quot;approval_date&quot;:&quot;2021-08-30&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;title&quot;:&quot;seminario del estudiante 2&quot;,&#xd;
            &quot;subject_id&quot;:14,&#xd;
            &quot;status&quot;:&quot;APPROVED&quot;,&#xd;
            &quot;description_status&quot;:&quot;Description de seminario&quot;,&#xd;
            &quot;approval_date&quot;:&quot;2021-08-30&quot;&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/inscriptions/11</stringProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Gestor de Cabecera HTTP" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Organization-Key</stringProp>
                <stringProp name="Header.value">ICT</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">App-Auth</stringProp>
                <stringProp name="Header.value">GAAPFC</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJodHRwOlwvXC8xMjcuMC4wLjE6ODAwMFwvYXBpXC9sb2dpbiIsImlhdCI6MTYyMDIzNDA3MSwiZXhwIjoxNjIwNDE0MDcxLCJuYmYiOjE2MjAyMzQwNzEsImp0aSI6IjRNd2tQM2xnTFlwZUpmbW8iLCJzdWIiOjEsInBydiI6Ijg3ZTBhZjFlZjlmZDE1ODEyZmRlYzk3MTUzYTE0ZTBiMDQ3NTQ2YWEiLCJ1c2VyIjp7ImlkIjoxLCJpZGVudGlmaWNhdGlvbiI6IjI0Njk4OTE2IiwiZmlyc3RfbmFtZSI6IkhlY3RvciIsInNlY29uZF9uYW1lIjpudWxsLCJmaXJzdF9zdXJuYW1lIjoiQWxheW9uIiwic2Vjb25kX3N1cm5hbWUiOm51bGwsInRlbGVwaG9uZSI6bnVsbCwibW9iaWxlIjoiKDEyMzQpIDU2Ny04OTAxIiwid29ya19waG9uZSI6bnVsbCwiZW1haWwiOiJoZWN0b3JAYWRtaW4uY29tIiwibGV2ZWxfaW5zdHJ1Y3Rpb24iOiJEciIsImFjdGl2ZSI6MSwid2l0aF9kaXNhYmlsaXRpZXMiOjAsInNleCI6Ik0iLCJuYXRpb25hbGl0eSI6IlYiLCJvcmdhbml6YXRpb25faWQiOiJJQ1QiLCJhZG1pbmlzdHJhdG9yIjp7ImlkIjoxLCJyb2wiOiJDT09SRElOQVRPUiIsInByaW5jaXBhbCI6MX0sInRlYWNoZXIiOnsiaWQiOjEsInRlYWNoZXJfdHlwZSI6IkNPTiIsImRlZGljYXRpb24iOiJFWEMiLCJjYXRlZ29yeSI6IklOUyIsImhvbWVfaW5zdGl0dXRlIjpudWxsLCJjb3VudHJ5IjpudWxsfSwic3R1ZGVudCI6W10sInJvbGVzIjpbeyJpZCI6MSwidXNlcl9pZCI6MSwidXNlcl90eXBlIjoiQSJ9LHsiaWQiOjMsInVzZXJfaWQiOjEsInVzZXJfdHlwZSI6IlQifV19fQ.EI0MwbH-M6nx7VWuRGUOC5G6VQvU0LSa9_kLjQd3C0Q</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Árbol de Resultados" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="Ver Resultados en Árbol " enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>